app/views/students_forums/index.html.erb

        <td><%= students_forum.description %></td>
        <td><%= students_forum.votes.count %></td>
---
SELECT COUNT(*) FROM `votes` WHERE `votes`.`students_forum_id` = 1