app/controllers/comments_controller.rb

  def create
    @students_forum = StudentsForum.find(params[:students_forum_id]) # 获取需要评论的话题
    @comment = @students_forum.comments.create(comment_params) # 对获取的话题创建评论
---
SELECT  `students_forums`.* FROM `students_forums` WHERE `students_forums`.`id` = 1 LIMIT 1
INSERT INTO `comments` (`content`, `students_forum_id`, `created_at`, `updated_at`) VALUES ('fdh', 1, '2016-10-05 13:42:06', '2016-10-05 13:42:06')