app/controllers/feedbacks_controller.rb

  def index
    @feedbacks = Feedback.all
---
SELECT `feedbacks`.* FROM `feedbacks`

  def create
    @feedback = Feedback.new(feedback_params)

    respond_to do |format|
      if @feedback.save
---
INSERT INTO `feedbacks` (`content`, `created_at`, `updated_at`) VALUES ('lala', '2016-10-04 15:07:51', '2016-10-04 15:07:51')