app/controllers/photos_controller.rb

  def index
    @photos = Photo.all
---
SELECT `photos`.* FROM `photos`

  def create
    @photo = Photo.new(photo_params)

    respond_to do |format|
      if @photo.save
---
INSERT INTO `photos` (`title`, `description`, `created_at`, `updated_at`, `picture`) VALUES ('gh', 'fdg', '2016-10-05 14:32:19', '2016-10-05 14:32:19', '6.png')

    def set_photo
      @photo = Photo.find(params[:id])
---
SELECT  `photos`.* FROM `photos` WHERE `photos`.`id` = 1 LIMIT 1