app/controllers/students_infos_controller.rb

SELECT `students_infos`.* FROM `students_infos`
---
  def index
    @students_infos = StudentsInfo.all # 获取所以学生信息内容

INSERT INTO `students_infos` (`name`, `number`, `phone`, `age`, `email`, `qq`, `address`, `created_at`, `updated_at`, `picture`, `sign`, `sex`) VALUES ('戴红梅', 20160902, '15725256235', 20, '2525351638@qq.com', '2525252525', '贵州师范大学13电信班', '2016-10-08 07:21:01', '2016-10-08 07:21:01', '11.png', '', '1')
---
  def create
    @students_info = StudentsInfo.new(students_info_params) # 接收填写的学生信息内容

    respond_to do |format|
      if @students_info.save # 保存学生信息

UPDATE `students_infos` SET `name` = '美眉', `sex` = 1, `number` = 2016090101, `phone` = '15225261863', `picture` = '11.png', `age` = 19, `email` = '25252525@qq.com', `qq` = '2525252525', `address` = '啦啦啦啦啦啦阿拉啦啦啦啦', `birthday` = '2011-10-02 15:33:00', `updated_at` = '2016-10-04 14:40:59' WHERE `students_infos`.`id` = 1
---
  def update
    respond_to do |format|
      if @students_info.update(students_info_params) # 修改学生休息

SELECT  `students_infos`.* FROM `students_infos` WHERE `students_infos`.`id` = 1 LIMIT 1
---
  def set_students_info
    @students_info = StudentsInfo.find(params[:id]) # 获取选中的内容，用于修改或者删除操作