app/controllers/students_forums_controller.rb

INSERT INTO `votes` (`students_forum_id`, `created_at`, `updated_at`) VALUES (1, '2016-10-04 15:48:16', '2016-10-04 15:48:16')
---
  def upvote
    @students_forum.votes.create

SELECT `students_forums`.* FROM `students_forums`
---
  def index
    @students_forums = StudentsForum.all

INSERT INTO `students_forums` (`title`, `description`, `created_at`, `updated_at`) VALUES ('devise', 'Devise plugin to reject weak passwords using zxcvbn\r\nUpdated 27 days ago', '2016-10-04 15:26:03', '2016-10-04 15:26:03')
---
  def create
    @students_forum = StudentsForum.new(students_forum_params)

    respond_to do |format|
      if @students_forum.save

UPDATE `students_forums` SET `description` = 'ruby可以做什么?\r\nRuby，一种为简单快捷的面向对象编程（面向对象程序设计）而创的脚本语言.', `updated_at` = '2016-10-08 06:49:47' WHERE `students_forums`.`id` = 2
---
  def update
    respond_to do |format|
      if @students_forum.update(students_forum_params)

SELECT  `students_forums`.* FROM `students_forums` WHERE `students_forums`.`id` = 2 LIMIT 1
---
    def set_students_forum
      @students_forum = StudentsForum.find(params[:id])